<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"fe58002bae02adf0501bdc62da7bfbae4667df8070f66a393b7e9c5090ea83c8","plan_job_ref":"Job Terraform Plan #30 at https://github.com/amc40/NextJS-Boilerplate/actions/runs/6762661946","plan_hash":"5e9eaa5d872a10af52b4c4ee219e1d64c606aa6c7e74b53b2ee21d78d56d6cb2","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __terraform__<details open><summary>With variables</summary>

```hcl
github_repository_name               = "NextJS-Boilerplate"
vercel_api_token                     = (sensitive value)
vercel_protected_deployment_password = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vercel_project_custom.vercel_project.vercel_project_with_github will be created
  + resource "vercel_project" "vercel_project_with_github" {
      + framework                               = "nextjs"
      + git_repository                          = {
          + production_branch = (known after apply)
          + repo              = "amc40/NextJS-Boilerplate"
          + type              = "github"
        }
      + id                                      = (known after apply)
      + name                                    = "nextjs-boilerplate"
      + password_protection                     = {
          + password           = (sensitive value)
          + protect_production = true
        }
      + protection_bypass_for_automation_secret = (known after apply)
      + serverless_function_region              = "lhr1"
      + team_id                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #30](https://github.com/amc40/NextJS-Boilerplate/actions/runs/6762661946)